In [12]:
import pandas as pd

dt = pd.read_csv("Students.csv")

dt.isnull().sum()

StudentID       0
Name            0
Gender          0
Age             0
MathScore       1
EnglishScore    1
TotalScore      0
dtype: int64

In [13]:
dt["MathScore"].fillna(dt["MathScore"].mean(), inplace = True)
dt["EnglishScore"].fillna(dt["EnglishScore"].mean(), inplace = True)

dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   StudentID     5 non-null      int64
 1   Name          5 non-null      object
 2   Gender        5 non-null      object
 3   Age           5 non-null      int64
 4   MathScore     5 non-null      float64
 5   EnglishScore  5 non-null      float64
 6   TotalScore    5 non-null      int64
dtypes: float64(2), int64(3), object(2)
memory usage: 408.0+ bytes

In [14]:
from sklearn.preprocessing import LabelEncoder

In [15]:
le = LabelEncoder()

dt["Gender"] = le.fit_transform(dt["Gender"])

In [16]:
dt[["Gender"]]

   Gender
0       0
1       1
2       1
3       0
4       0

In [17]:
dt["TotalScore"] = dt["MathScore"] + dt["EnglishScore"]

dt

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice       0   15       85.0          90.0       175.0
1          2      Bob       1   16       82.5          95.0       177.5
2          3  Charlie       1   15       80.0          85.0       165.0
3          4    Diana       0   16       90.0          85.0       175.0
4          5      Eve       0   15       75.0          70.0       145.0

In [18]:
from sklearn.preprocessing import StandardScaler

In [19]:
scaler = StandardScaler()

dt[["MathScore", "EnglishScore", "TotalScore"]] = scaler.fit_transform(dt[["MathScore", "EnglishScore", "TotalScore"]])
dt

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice       0   15        0.5      0.597614    0.622841
1          2      Bob       1   16        0.0      1.195229    0.830455
2          3  Charlie       1   15       -0.5      0.000000   -0.207614
3          4    Diana       0   16        1.5      0.000000    0.622841
4          5      Eve       0   15       -1.5     -1.792843   -1.868523